[
    {
        "id": 1,
        "title": "Autumn Days",
        "category": 1,
        "image": "https://images.pexels.com/photos/531857/pexels-photo-531857.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "It is autumn. The leaves turn red, yellow, and orange. The weather is cool. Mary wears a warm jacket and a hat. She walks in the park with her dog, Max.",
            "Mary and Max see many leaves on the ground. Max likes to play with the leaves. He jumps and runs. Mary smiles and takes pictures.",
            "They also see pumpkins in the park. Mary thinks the pumpkins are nice. She wants to make a pumpkin pie.",
            "After walking, Mary and Max go home. They are happy. Mary feels the joy of autumn."
        ],
        "definitions": [
            "autumn",
            "pumpkin",
            "wear",
            "pie",
            "feel",
            "leave",
            "turn"
        ]
    },
    {
        "id": 2,
        "title": "The Big Ocean",
        "category": 1,
        "image": "https://images.pexels.com/photos/1298684/pexels-photo-1298684.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "Once upon a time, there was a big ocean. The ocean was very wide and blue. Many fish lived in the ocean. They were happy and swam all day.",
            "One day, a small fish named Timmy was swimming near the surface. Timmy saw a big boat. He was curious and swam closer. Timmy saw people on the boat. They were fishing and having fun.",
            "Timmy wanted to talk to the people, but he knew he could not. He just watched them from the water. The people threw some food into the ocean. Timmy and his friends were excited. They swam to the food and ate it.",
            "After a while, the boat left, and the ocean was quiet again. Timmy and his friends continued to swim and play. They were happy in their big, beautiful ocean.",
            "And so, Timmy lived happily in the ocean, always enjoying the beautiful blue water and his fish friends."
        ],
        "definitions": [
            "once",
            "upon",
            "wide",
            "surface",
            "quiet",
            "enjoy"
        ]
    },
    {
        "id": 3,
        "title": "Sunset",
        "category": 1,
        "image": "https://images.pexels.com/photos/267151/pexels-photo-267151.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "Every day, the sun goes down. This is called sunset.",
            "One evening, Anna went to the park. She saw the sky turn orange and pink. It was beautiful.",
            "Anna sat on a bench and watched. The sun was getting lower. Soon, it disappeared behind the hills.",
            "Anna felt happy and calm. She loved the sunset. It made her smile.",
            "And so, every evening, Anna looked forward to the sunset."
        ],
        "definitions": [
            "sunset",
            "pink",
            "disappeared",
            "behind",
            "forward"
        ]
    },
    {
        "id": 4,
        "title": "Rain",
        "category": 1,
        "image": "https://images.pexels.com/photos/9648468/pexels-photo-9648468.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "One day, it started to rain. The sky was grey, and the drops were big.",
            "Liam was at home. He looked out the window. The rain made everything wet.",
            "Liam loved the sound of the rain. It was soft and relaxing.",
            "He decided to go outside with his umbrella. He walked in the rain, feeling happy.",
            "Liam thought rain was beautiful. It made him feel peaceful."
        ],
        "definitions": [
            "rain",
            "window",
            "umbrella",
            "wet",
            "peaceful"
        ]
    },
    {
        "id": 5,
        "title": "Football Game",
        "category": 2,
        "image": "https://images.pexels.com/photos/399187/pexels-photo-399187.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "Every Saturday, Jack plays football with his friends. They love the game.",
            "Jack runs fast on the field. He tries to kick the ball into the goal.",
            "Today, Jack's team won the game. Everyone was happy and cheered.",
            "After the game, Jack and his friends drank water and talked about the match.",
            "Jack was tired but excited. He loved playing football."
        ],
        "definitions": [
            "football",
            "friends",
            "goal",
            "cheered",
            "tired"
        ]
    },
    {
        "id": 6,
        "title": "Movie Night",
        "category": 3,
        "image": "https://images.pexels.com/photos/2507025/pexels-photo-2507025.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "Sara and her family love movie night. Every Friday, they watch a movie together.",
            "Tonight, they picked a funny movie. Everyone laughed a lot.",
            "Sara's mom made popcorn. It was warm and tasty.",
            "They all sat on the couch, enjoying the movie and the snacks.",
            "Sara was happy to spend time with her family. Movie nights were the best."
        ],
        "definitions": [
            "movie",
            "popcorn",
            "couch",
            "funny",
            "snacks"
        ]
    }
]