[
    {
        "id": "a2_1",
        "title": "A Walk in the Forest",
        "category": 1,
        "image": "https://images.pexels.com/photos/167698/pexels-photo-167698.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "On Saturday morning, Emily decided to take a walk in the forest near her home.",
            "The trees were tall, and the ground was covered with leaves. She could hear birds chirping and the sound of a small stream.",
            "As she walked deeper into the forest, she saw a deer standing quietly among the trees. It looked at her, then slowly walked away.",
            "Emily felt connected to nature. The forest was calm, and it helped her clear her mind.",
            "She promised herself to visit the forest more often to enjoy the peace it offered."
        ],
        "definitions": [
            "forest",
            "leaves",
            "stream",
            "deer",
            "connected"
        ]
    },
    {
        "id": "a2_2",
        "title": "The Big Race",
        "category": 2,
        "image": "https://images.pexels.com/photos/158971/pexels-photo-158971.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "Tom had been training for weeks for the big race in his town. He ran every morning, trying to get faster.",
            "The day of the race finally arrived. Tom was nervous but excited. He knew he had worked hard for this moment.",
            "As the race began, Tom focused on his breathing and pace. The other runners were strong, but he didn’t give up.",
            "In the last stretch, Tom pushed himself harder. He crossed the finish line, tired but proud.",
            "Tom didn’t win the race, but he felt like a champion because he gave his best effort."
        ],
        "definitions": [
            "race",
            "training",
            "nervous",
            "pace",
            "finish line"
        ]
    },
    {
        "id": "a2_3",
        "title": "A Night at the Cinema",
        "category": 3,
        "image": "https://images.pexels.com/photos/33129/popcorn-movie-party-entertainment.jpg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "Sarah and her friends decided to go to the cinema on Friday night. They chose a new action movie that everyone was talking about.",
            "The cinema was crowded, but they managed to find good seats in the middle of the theater.",
            "As the movie started, Sarah was immediately hooked. The special effects were amazing, and the story was exciting.",
            "During the movie, they shared a big bucket of popcorn and laughed at the funny scenes.",
            "When the movie ended, Sarah and her friends couldn’t stop talking about it. They all agreed it was one of the best movies they had seen in a long time."
        ],
        "definitions": [
            "cinema",
            "crowded",
            "hooked",
            "special effects",
            "theater"
        ]
    },
    {
        "id": "a2_4",
        "title": "Helping a Stranger",
        "category": 4,
        "image": "https://images.pexels.com/photos/12537600/pexels-photo-12537600.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "One afternoon, while walking home from school, James saw an elderly man struggling to carry his groceries.",
            "The bags were heavy, and the man looked tired. James decided to help him.",
            "He offered to carry the bags, and the man gratefully accepted. Together, they walked to the man’s house, which was not far.",
            "The man thanked James for his kindness and offered him a small reward, but James politely refused.",
            "As he walked away, James felt good about helping someone in need. He knew that a small act of kindness could make a big difference."
        ],
        "definitions": [
            "elderly",
            "groceries",
            "struggling",
            "gratefully",
            "kindness"
        ]
    },
    {
        "id": "a2_5",
        "title": "The Friday Prayer",
        "category": 8,
        "image": "https://images.pexels.com/photos/337904/pexels-photo-337904.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "Omar woke up early on Friday morning. He knew it was a special day because it was time for the Friday prayer.",
            "He took a shower, wore his best clothes, and walked to the mosque with his father.",
            "The mosque was peaceful, and many people were there, ready for the prayer.",
            "Omar listened carefully to the sermon. The Imam talked about kindness and helping others.",
            "After the prayer, Omar felt happy and peaceful. He decided to help his neighbors that afternoon."
        ],
        "definitions": [
            "Friday",
            "prayer",
            "mosque",
            "sermon",
            "kindness"
        ]
    },
    {
        "id": "a2_6",
        "title": "A Visit to the Orphanage",
        "category": 8,
        "image": "https://images.pexels.com/photos/3076178/pexels-photo-3076178.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "Amina and her family planned to visit the orphanage on Saturday.",
            "They brought toys, clothes, and food for the children living there.",
            "When they arrived, the children were so happy to see them. Amina played with the kids and made new friends.",
            "Her father spoke to the orphanage manager and learned about the children's needs.",
            "Amina felt grateful for what she had and decided to come back every month to help the children."
        ],
        "definitions": [
            "orphanage",
            "toys",
            "clothes",
            "grateful",
            "help"
        ]
    },
    {
        "id": "a2_7",
        "title": "Sharing in Ramadan",
        "category": 8,
        "image": "https://images.pexels.com/photos/2233416/pexels-photo-2233416.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "During Ramadan, Ali’s family prepared food to share with their neighbors.",
            "Ali helped his mother cook delicious meals and pack them in boxes.",
            "In the evening, they went door to door, giving the food to their neighbors.",
            "The neighbors were thankful and happy to receive the food.",
            "Ali felt proud and happy that he could help others during this special month."
        ],
        "definitions": [
            "Ramadan",
            "share",
            "neighbors",
            "thankful",
            "special"
        ]
    },
    {
        "id": "a2_8",
        "title": "Helping the Poor",
        "category": 8,
        "image": "https://images.pexels.com/photos/1250452/pexels-photo-1250452.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "One day, Fatima saw a poor man on the street. He looked hungry and cold.",
            "She quickly went home, packed some food and clothes, and brought them to the man.",
            "The man smiled and thanked Fatima. She felt so happy that she could help someone in need.",
            "Fatima learned that helping others is very important in Islam.",
            "She decided to always carry some food and clothes with her to help the poor."
        ],
        "definitions": [
            "poor",
            "hungry",
            "help",
            "important",
            "Islam"
        ]
    },
    {
        "id": "a2_9",
        "title": "Staying Healthy",
        "category": 6,
        "image": "https://images.pexels.com/photos/348689/pexels-photo-348689.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "Daphne wants to stay healthy. She knows that eating well is important.",
            "Every morning, Daphne eats a healthy breakfast. She has eggs, toast, and fruit.",
            "After breakfast, she goes for a walk in the park. Walking is good for her heart.",
            "Daphne drinks water all day to stay hydrated. She also likes to play sports with her friends.",
            "By taking care of her health, Daphne feels happy and energetic every day."
        ],
        "definitions": [
            "healthy",
            "breakfast",
            "walk",
            "hydrated",
            "energetic"
        ]
    },
    {
        "id": "a2_10",
        "title": "Learning at School",
        "category": 7,
        "image": "https://images.pexels.com/photos/159213/hall-congress-architecture-building-159213.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "paragraphs": [
            "Michel goes to school every day. He enjoys learning new things.",
            "In math class, he likes to solve problems with his friends. They help each other.",
            "Michel also loves science. He learns about plants and animals.",
            "At recess, Michel plays soccer with his classmates. They have fun together.",
            "Every day at school, Michel learns and plays. He is excited to see his friends."
        ],
        "definitions": [
            "school",
            "learning",
            "math",
            "science",
            "recess"
        ]
    }
]